app/controllers/articles_controller.rb

  def index
    @articles = Article.page(params[:page]).per(10)
---
SELECT  "articles".* FROM "articles" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "articles"

  def show

    @article = Article.find(params[:id])

    #@comments = Comment.page(params[:page]).per(5) [ok mais pour l'article 2 commence l'affichage
                                                # des comments à partir de la page qui suit celle
                                                # où les comments de l'article 1 ont pris fin
                                                # du coup on se retrouve avec des 1eres pages vides
                                                # pour l'article 2]

    @comments = Comment.where(article_id: @article).page(params[:page]).per(5) # tri des comments au niveau du controller
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = 1 LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = 1